Tekla.Structures.Dialog.UIControls.WpfComponentCatalog
The WpfComponentCatalog class represents a group of controls to select components
using the component catalog.
WpfComponentCatalog

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.selectedName
field for selected name

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.selectedNumber
field for selected number

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.currentDispatcher
dispatcher for control

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.#ctor
Initializes a new instance of the WpfComponentCatalog class.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.SelectedName
Gets or sets the selected component name in the control.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.SelectedNumber
Gets or sets the selected component number in the control.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.ShowPicker(System.Object,System.EventArgs)
Opens the component catalog dialog in picker mode for selecting a component
sender: The sender.
args: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.button_Click(System.Object,System.Windows.RoutedEventArgs)
Opens the component catalog dialog for selecting a component
sender: The sender.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfComponentCatalog.InitializeComponent
InitializeComponent